    .data # Αρχή τμήματος μνήμης δεδομένων (Data Segment)
Const01: .float 0.8 # Σταθερά σε απλής ακρίβεια (α.α.) με τιμή 0.8
    .text # Αρχή τμήματος μνήμης κειμένου, {δηλ. κώδικα} (Text Segment)
 
    mtc1 $zero, $f4 # $f4 <- 0
    cvt.s.w $f4, $f4 # Μετατροπή από ακέραιο σε απλή ακρίβεια ($f4 <- 0.0)
    mtc1 $zero, $f6 # $f6 <- 0
    cvt.s.w $f6, $f6 # Μετατροπή από ακέραιο σε απλή ακρίβεια ($f6 <- 0.0)
    addi $t0, $zero, 5 # $t0 <- 5
    mtc1 $t0, $f8 # $f8 <- 5
    cvt.s.w $f8, $f8 # Μετατροπή από ακέραιο σε απλή ακρίβεια ($f8 <- 5.0)
Loop: 
    c.lt.s $f4, $f8 # αν i<5.0 =>flag_0_Corp1 <- True, αλλιώς flag_0_Copr1 <- False
    bc1f, Endloop # αν flag_0_Copr1 = False τότε άλμα στην Endloop
    add.s $f6, $f6, $f4 # s <- s + i
    la $t0, Const01 # Φόρτωση της διεύθυνσης της ετικέτας Const01 στον $t0
    lwc1 $f10, 0($t0) # Φόρτωση στον $f10 του πραγματικού α.α. ($f10 <- 0.8)
    add.s $f4, $f4, $f10 # i <- i + 0.8
    j Loop # Άλμα στην ετικέτα Loop
Endloop: 