    .data # Αρχή τμήματος μνήμης δεδομένων (Data Segment)
Const01: .double 0.1 # Σταθερά σε διπλή ακρίβεια (δ.α.) με τιμή 0.1
    .text # Αρχή τμήματος μνήμης κειμένου, {δηλ. κώδικα} (Text Segment)
    
    mtc1 $zero, $f4 # $f4 <- 0
    cvt.d.w $f4, $f4 # Μετατροπή από ακέραιο σε διπλή ακρίβεια ($f4/$f5 <- 0.0)
    mtc1 $zero, $f6 # $f6 <- 0
    cvt.d.w $f6, $f6 # Μετατροπή από ακέραιο σε διπλή ακρίβεια ($f6/$f7 <- 0.0)
    addi $t0, $zero, 5 # $t0 <- 5
    mtc1 $t0, $f8 # $f8 <- 5
    cvt.d.w $f8, $f8 # Μετατροπή από ακέραιο σε διπλή ακρίβεια ($f8/$f9 <- 5.0
Loop: 
    c.lt.d $f4, $f8 # αν i<5.0 =>flag_0_Corp1 <- True, αλλιώς flag_0_Copr1 <- False
    bc1f, Endloop # αν flag_0_Copr1 = False τότε άλμα στην Endloop
    add.d $f6, $f6, $f4 # s <- s + i
    la $t0, Const01 # Φόρτωση της διεύθυνσης της ετικέτας Const01 στον $t0
    ldc1 $f10, 0($t0) # Φόρτωση στον $f10 του πραγματικού δ.α. ($f10/f11 <- 0.1)
    add.d $f4, $f4, $f10 # i <- i + 0.1
    j Loop # Άλμα στην ετικέτα Loop
Endloop: