#include <stdio.h>
#include <stdlib.h>
//Δήλωση συνάρτησης check. Η συνάρτηση επιστρέφει 0 αν οι συμβολοσειρές ειναι ίδιες
//1 αν η πρώτη ειναι μεγαλήτερη
// και -1 αν η πρώτη ειναι μικρότερη 
//H συνάρτηση πέρνει ως ορίσματα τους πίνακες a[] και b[]. (οι συμβολοσειρές του χρήστη)
int check(char a[] , char b[]);

//αρχή της κύριας συνάρτησης του προγράμματος 
int main(int argc, char *argv[])
{
    char str1[50]; 
    char str2[50]; 
    //Είσοδος απο τον χρήστη της πρώτης σειμβολοσειρας
    printf("Enter the first string : ");  
    scanf("%s",str1);  
    //Είσοδος απο τον χρήστη της δεύτερης σειμβολοσειρας
    printf("\nEnter the second string : ");  
    scanf("%s",str2);  

    //Έλενχος των δυο συμβολοσειρών με χρήση της συνάρτησης check
    if(check(str1,str2)==0)
        printf("Strings are the same");
    else if(check(str1,str2)==1)
        printf("\nString 1 {%s} is greater than string 2 {%s}",str1,str2);
    else 
        printf("\nString 2 {%s} is grater than string 1 {%s}",str2,str1 );

    
    system("pause");
    return 0; 
}

//Αρχή σύναρτησης check
int check(char a[] ,char b[])
{

    int i=0 ;

    //επαναληπτική δομή while. Ελένχει αν το στοιχείο της συμβολοσειρας 1 ειναι ίδιο με της 2ης
    while (a[i] == b[i])
    {
        if (a[i] == '\0' || b[i] == '\0')
            //αν μια απο τις δυο συμβολοσειρες τελειώσει τοτε ειναι διαφορετικες και τελειώνει η επαναληψη
            break;
            //αλλιώς ενελένχουμε το επομενο στοιχείο 
        else
           i++;
    }

    //Αν και οι δυο σειμβολοσειρές τελειώσανε στο ιδιο σημειο τοτε ειναι ίσες 
    //το βλέπουμε απο την παραπάνω επαναληπτική δομή
    if (a[i] == '\0' && b[i] == '\0')
        //η συνάρτηση επιστέφει 0 
        return 0;
 
    else
    {   
        //στην περίπτοση που δεν ειναι ισες τοτε ελένχουμε ποια ειναι μεγαλύτερη 
        if (a[i]>b[i])
            //η συνάρτηση επιστρέφει 1 
            return 1;
        else 
            //η συνάρτηση επιστρέφει -1
            return -1;
    }
}
